[
  {
    "path": "posts/welcome/",
    "title": "Welcome to Jin Ru (Alethea)'s Blog",
    "description": "Welcome to my new blog. Hope you enjoy the upcoming DataViz Makeover posts!",
    "author": [
      {
        "name": "Lim Jin Ru (Alethea)",
        "url": "https://www.linkedin.com/in/alethea-lim"
      }
    ],
    "date": "2021-05-30",
    "categories": [],
    "contents": "\r\n\r\n\r\nFALSE\r\n\r\n\r\n[1] FALSE\r\n\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-05-30T18:30:41+08:00",
    "input_file": "welcome.knit.md"
  },
  {
    "path": "posts/2021-05-30-dataviz-makeover-1/",
    "title": "DataViz Makeover 1",
    "description": "A makeover of a data visualisation created from data provided by Department of Statistics, Singapore (DOS).",
    "author": [
      {
        "name": "Lim Jin Ru (Alethea)",
        "url": "https://www.linkedin.com/in/alethea-lim"
      }
    ],
    "date": "2021-05-30",
    "categories": [],
    "contents": "\r\n\r\nContents\r\n1) Current data visualisation\r\n2) Critiques and suggestions for current visualisation\r\n2.1 Clarity\r\n2.2 Aesthetics\r\n\r\n3) Proposed Design\r\n3.1 Sketch\r\n3.2 Advantages of proposed design\r\n\r\n4) Data Visualization Steps\r\n4.1 Data Preparation\r\n\r\n5) Final Visualisation\r\n5.1 Main Observations\r\n\r\n\r\n1) Current data visualisation\r\n\r\nThe current data visualisation above had been created by using data provided by Department of Statistics, Singapore (DOS). The data are available under the sub-section of Merchandise Trade by Region/Market.\r\n2) Critiques and suggestions for current visualisation\r\n2.1 Clarity\r\nS/N\r\nCritiques\r\nSuggestions\r\n1\r\nMissing critical information in data visualization title. The overall data visualization title omitted the necessary information that the data specifically represent Singapore’s top 6 trading countries.\r\nRename the title to include reference to Singapore: “Singapore’s Merchandise Trade of Top Six Trading Countries, 2019 – 2020”\r\n2\r\nMissing data source information - The data visualization chart does not specify the data source, making it challenging for readers to be able to refer to the source data\r\nThe data source should always be included in data visualizations so that readers can understand where the figures are from and also to refer to it for more details.\r\n3\r\nInconsistent x-axis scales for the charts - For most charts, the x-axis reflected 2019, 2020 and 2021 as the major x-axis points but for Japan’s chart, it only reflected 2020.\r\nAlign the x-axis dates used for the charts (e.g. 2019, 2020)\r\n4\r\nMissing labels/legend information for brown shaded area in the charts. Based on the legend, the blue shaded areas represent the exports and the orange shaded areas represent the imports but it is not clear to readers what the brown shaded areas represent.\r\nThe suggestion is to either create title labels for all the shaded areas or to include the label names for the brown shaded area in the legend.\r\n2.2 Aesthetics\r\nS/N\r\nCritiques\r\nSuggestions\r\n1\r\nThe overall data visualization title’s font size is smaller than the chart titles.\r\nIncrease the overall data visualization title font size relative to the individual chart title’s font size.\r\n2\r\nLack of opacity for area graph - For example, the trend line for Singapore’s imports with Malaysia in the “Malaysia” chart is concealed for most of 2019 by the brown shaded area. Hence, that information will not be visible to readers.\r\nDecrease the opacity for the graphs on the top layers where applicable so that the bottom layers’ trend movements are still visible. Another point to note is that shaded area graphs might not be the most ideal for ease of readability of imports and exports’ trends over time for this data visualization. Bar graphs or line graphs could be considered to facilitate comparisons.\r\n3\r\nLack of difference in visual cues between imports and exports dual-axis titles with same font colours.\r\nIt will be better to match the font title colors on the dual-axis with the import and export colors of the area graph (e.g. blue font to match with the blue shaded area, representing exports and orange font to match the orange shaded area, representing imports).\r\n4\r\nChoice of colors in the graph\r\nColors selected that represent different variables should have more contrasting colors (e.g. the orange and brown colors used in the charts are too similar). Use more contrasting colors within the same chart to represent different variables.\r\n3) Proposed Design\r\n3.1 Sketch\r\n\r\n3.2 Advantages of proposed design\r\nClear overall data visualization title – The proposed design’s title, Singapore (SG)’s merchandise trade with its top 6 trading countries, 2019 – 2020 clearly informs reader that the data visualization is about Singapore’s merchandise trade and not an anonymous country’s merchandise trade\r\nAxis are properly labelled. For the charts, there are no inconsistent x-axis on the scales – all the countries’ bar graph represent 2020 vs 2019 and there’s no ambiguity on the x-axis scales.\r\nContrasting colors are used in the charts (e.g. blue vs red to represent negative net exports and positive net exports respectively).\r\nThere is commentary in the proposed design to provide more context when reading the graphs.\r\nIn the proposed design, it is easier to see the relative comparison of imports and exports within the country and across the 6 trading countries with use of bar charts and butterfly chart.\r\n4) Data Visualization Steps\r\n4.1 Data Preparation\r\nRetrieving data source\r\nThe excel data of Singapore’s Merchandise Trade by Region/Market was downloaded from the Department of Statistics, Singapore (DOS).\r\n\r\n\r\nDelete the content page of the downloaded excel file as only the worksheets T1 with Singapore’s Merchandise Imports data and T2 with Merchandise Exports data are required.\r\nDelete unwanted header rows (rows 1 – 5) and all data columns except for the 2019 – 2020 period for both T1 and T2 worksheet. For the variables, we only retain data for Hong Kong, China, Malaysia, Taiwan, United States and Japan.\r\nThe data is then transposed with the country variables appearing as rows and date variables appearing as columns for both the exports and imports worksheets. The two worksheets are renamed as Exports - transposed and Imports - transposed.\r\nThe prepared excel file is then imported into Tableau.\r\nDrag both tables under sheets to the canvas.\r\n\r\nDouble click on the dotted line between the two tables on the canvas.\r\n\r\nUpdate the relationship between the two tables. In this case, variables of the exports table is equivalent to the variables of the imports table.\r\n\r\nInspect the data in the Data Source pane. Tableau interpreted the import and export figures as text instead of numbers. This data type will need to be corrected.\r\nClick the data type icon for the field (as shown in the table below).\r\nChange the data type from the drop-down list from String to Number (whole).\r\n\r\nUpdate the export and import figures to convert them to their full actual values rather than in terms of thousands.\r\nClick on create calculated field in the small arrow on the right hand corner of the column.\r\n\r\nEnter the formula to calculate the new field and rename the variable accordingly. The new variables will be used in the worksheets and the original column figures with the header “… (Thousand Dollars)” will be hidden. For export figures, we add the word ‘E’ behind the country name to allow us to differentiate the variables easily for future calculated fields.\r\n\r\nThe first chart will be Singapore’s net exports with each of its top 6 trading countries\r\nA new worksheet is created on Tableau and renamed ‘Net Exports’\r\nCalculated fields will need to be created for Net Exports pills for each country. The formula for net exports is exports minus imports.The pills will be named in the format Country - NE where NE stands for Net Exports.\r\n\r\nThe following pills are dropped into the Rows and Columns shelves.\r\n\r\nThe following pills are dropped into the Filters, Marks and Measure Values shelves respectively.\r\n\r\nClick Edit Colors on the Marks shelf.\r\nChange the bar chart colors to show red for negative values and blue for positive values.\r\nCheck the stepped color option and select 2 steps. Check the centre box and enter 0 to keep the stepped colors separated at the 0 value mark.\r\n\r\nAdd reference line of 0 value on the y-axis to improve clarity of chart between the positive and negative values. Enter the selections in the screenshot below.\r\n\r\nFormat the net exports figures under measure values to reflect the numbers in $0.00B format\r\n\r\nA butterfly chart is to be created for the other chart in the data visualization for imports vs exports.\r\nThe main use of the butterfly chart is comparison of two data sets sharing the same parameters. For example, a butterfly chart looks like the below:\r\n\r\nThe following pills are dropped into the Rows and Columns shelves.\r\n\r\nThe following pills are dropped into the Filters, Marks and Measure Values shelves respectively.\r\n\r\nThe bar graphs will all be in blue for the imports graph.\r\nEdit colors on measure names and select the same blue color tone for all country name variables.\r\n\r\nThe display of the horizontal bar graphs need to be reversed to the left side.\r\nRight-click on the x-axis and select edit axis\r\nCheck the reversed scale selection on edit axis\r\n\r\nMeasure values card was placed in the shelves twice so that it can be used to update the placement of the year title on the desired spot. Two graphs are hence reflected side-by-side on the worksheet.\r\nRight click on the x-axis for the second graph in the worksheet and click on dual-axis\r\nClick on synchronise axis and uncheck - show header\r\n\r\nAdd the Year pill to the second Measure values shelf.\r\n\r\nUncheck all the x-axis headers. The x-axis titles on the exports graph (right-hand side of the butterfly chart will be used to represent the aligned x-axis instead.\r\n\r\nThe finalized imports graph (left-hand side of the butterfly chart) looks like the below:\r\n\r\nThe same steps are repeated for the total exports graph except that the x-axis does not need to be reversed for this graph.\r\n\r\nDashboard\r\nAdd title\r\nAdd title: “Singapore (SG)’s merchandise trade with its top 6 trading countries, 2019 – 2020”\r\n\r\nAdd commentary\r\nUsing objects > text > drag text icon to below to title and add commentary text\r\n\r\nAdd sheets + Add sheets “Net Exports” to the top right of the dashboard. + Add sheets “Total Imports Comparison” to the bottom left of the dashboard. + Add sheets “Total Exports Comparison” to the bottom right of the dashboard.\r\nAdd text box\r\nAdd floating text for “top net importer” and “top net exporter”. The word “net” was underlined to emphasize that this is the net relationship and not the absolute relationship (for example, Singapore’s top importer and top exporter is China but top net importer is Taiwan and top net exporter is Hong Kong)\r\n\r\nAdd source\r\nUsing objects > text > drag text icon to bottom left of dashboard and add the source\r\n\r\nAdd author\r\nAdd text to bottom right corner and add author text\r\n\r\n\r\n5) Final Visualisation\r\nLink to Tableau Public\r\n\r\n5.1 Main Observations\r\nNegative net exports (exports < imports) is equivalent to trade deficit and positive net exports (exports > imports) is equivalent to trade surplus. All the observations below relate to merchandise trade between Singapore and each of its top 6 trading countries in 2019 and 2020.\r\nSingapore’s trade deficit with Malaysia and Taiwan grew in 2020 as compared to 2019\r\nTrade deficit growth with Malaysia from $0.73B to $11.65B. This is due to the combined growth of imports from Malaysia and fall in exports to Malaysia\r\nTrade deficit growth with Taiwan from $21.81B to $24.93B. There is growth of exports to Taiwan but this is outpaced by the growth of imports from Taiwan\r\n\r\nSingapore’s trade deficit with Japan shrank in 2020 as compared to 2019\r\nTrade deficit shrinkage with Japan from $2.37B to $0.34B). This is due to growth of exports to Japan and shrinkage of imports from Japan\r\n\r\nSingapore’s trade surplus with China and Hong Kong grew in 2020 as compared to 2019\r\nTrade surplus growth with China from $3.53B to $5.48B\r\nThis is due to growth of exports to China and shrinkage of imports from China\r\n\r\nTrade surplus growth with Hong Kong from $55.78B to $58.52B. There is growth of imports from Hong Kong but this is outpaced by the growth of exports to Hong Kong\r\nSingapore had trade deficit with US in 2019 but trade surplus with US in 2020\r\nTrade deficit with US turned to trade surplus from -$14.40B to $5.67B\r\nThis is due to growth of exports to US and shrinkage of imports from US\r\n\r\n\r\nHong Kong is Singapore’s top net exporter in 2019 & 2020\r\nTaiwan is Singapore’s top net importer in 2019 & 2020\r\nChina is Singapore’s top importer and top exporter in 2019 & 2020\r\n\r\n\r\n\r\n",
    "preview": "posts/2021-05-30-dataviz-makeover-1/img/FinalDashboard.jpg",
    "last_modified": "2021-05-30T21:13:25+08:00",
    "input_file": "dataviz-makeover-1.knit.md"
  }
]
